package com.company;

public class QualityCode {
    public static void main(String[] args) {
//        1. Променливи
//          -започва с малка буква и след това главни
//          -без едно наум, имената може да са дълги, но да се знае какви са; без съкращения
//          -бъдете консистентни - един тип имена (rectangleSurface и surfaceOfRectangle e неконсистентно)
//
//        2. Методи
//          -имената трябва да са описателни(сложете to пред името и трябва да има логика <formatLetter не formattingLetter>
//          -не повече от четири променливи в код
//          -трябва да правят едно единствено нещо
//          -без едно наум, бъдете консистентни
//
//        3. Форматиране
//          -подреден код, смислово разграничаване(разделяне) на блокове, за лесно четене
//          -декларирайте променливите в близост до тяхното използване
//          -методи, които се извикват един в друг, трябва да са в близост(извиканият трябва да е под този, в който се извиква)
//          -кратки редове - прехвърляне на нови редове, при твърде дълги операции
//          -без повтаряне на код
//          -използвайте Ctrl+Alt+L
//        4. Коментари!!!
//          -обяснявайте сложните алгоритми
//          -ТОДО
    }
}
